# ExternalDataInstanceAddedIntoDocumentEventArgs Properties (2024)

---
C#Visual BasicVisual C++
Include Protected MembersInclude Inherited Members
Revit 2024 API
---
ExternalDataInstanceAddedIntoDocumentEventArgs Properties
ExternalDataInstanceAddedIntoDocumentEventArgs Class See Also
---
The ExternalDataInstanceAddedIntoDocumentEventArgs type exposes the following members.
# Properties
| Name | Description |
| --- | --- |
| --- | --- | --- |
| Cancellable | Indicates whether an event may be cancelled by an event delegate.  (Inherited from RevitAPIEventArgs.) |
| Document | The document associated with the event.  (Inherited from RevitAPIPostDocEventArgs.) |
| IsValidObject | Specifies whether the .NET object represents a valid Revit entity.  (Inherited from RevitAPIEventArgs.) |
| ItemId | The id of the external data item to which a new reference has been added. |
| NewInstanceId | The newly added external data instance id. |
| ProjectId | The id of the external project of the external data item to which a new reference has been added. |
| Status | Indicates whether the action associated with this event succeeded, failed, or was cancelled (by an API event handler).  (Inherited from RevitAPIPostEventArgs.) |
| TypeId | The type id of the newly added external data instance id. |

# See Also
ExternalDataInstanceAddedIntoDocumentEventArgs Class
Autodesk.Revit.DB.Events Namespace